[
    [
        "I-1974010303", 
        "DAHLEN TRANSPORT INC", 
        "SKELLY OIL COMPANY*", 
        0.0, 
        "1974-01-11", 
        null, 
        null, 
        null, 
        "PETROLEUM GASES  LIQUEFIED OR LIQUEFIED PETROLEUM GAS", 
        0.0, 
        null, 
        null
    ], 
    [
        "I-1977051410", 
        "AMOCO OIL CO.", 
        "B P AMOCO OIL INC", 
        0.0, 
        "1977-05-17", 
        null, 
        null, 
        null, 
        "GASOLINE INCLUDES GASOLINE MIXED WITH ETHYL ALCOHOL  WITH NOT MORE THAN 10% ALCOHOL", 
        200.0, 
        "LGA", 
        null
    ], 
    [
        "I-1983080293", 
        "DAHLEN TRANSPORT  INC", 
        "LAND O LAKES INC", 
        0.0, 
        "1983-07-28", 
        null, 
        null, 
        null, 
        "HEXANES", 
        1.0, 
        "LGA", 
        null
    ], 
    [
        "I-1977010022", 
        "AMOCO OIL CO.", 
        "B P AMOCO OIL INC", 
        0.0, 
        "1976-12-18", 
        null, 
        null, 
        null, 
        "GASOLINE INCLUDES GASOLINE MIXED WITH ETHYL ALCOHOL  WITH NOT MORE THAN 10% ALCOHOL", 
        8000.0, 
        "LGA", 
        null
    ], 
    [
        "I-2001020075", 
        "STORMY TRANSPORT INC", 
        "MAGELLAN PIPELINE COMPANY  L.P.", 
        107600.0, 
        "2001-01-29", 
        "1300", 
        "; ;", 
        "Punctured; Burst or Ruptured; Crushed", 
        "GASOHOL GASOLINE MIXED WITH ETHYL ALCOHOL  WITH NOT MORE THAN 10% ALCOHOL", 
        8803.0, 
        "LGA", 
        "OUR VEHICLE WAS INVOLVED WITH ANOTHER SEMI-TRAILER. THE OTHER VEHICLE RAN A STOP SIGN  THEN T BONEING OUR TANKER. THE CRASH CAUSED OUR TANKER TO TIP OVER AND CAUSING PRODUCT TO SPILL OUT. DURING CRASH THE GASOLINE SPILLED OUT AND WAS IGNITED. ALL PRODUCT WAS BURNED UP AND THE SITE WAS TESTED WITH NO PRODUCT CONTAMINATING THE AREA. THE DRIVER OF THE  OTHER TRACTOR WAS KILLED ON IMPACT. OUR DRIVER WAS TREATED AND RELEASED. ALL VEHICLES WERE TOWED FROM SCENE."
    ], 
    [
        "I-1976080677", 
        "YUCON SALES CO", 
        "YUKON SALES CO", 
        0.0, 
        "1976-07-29", 
        null, 
        null, 
        null, 
        "GASOLINE INCLUDES GASOLINE MIXED WITH ETHYL ALCOHOL  WITH NOT MORE THAN 10% ALCOHOL", 
        8975.0, 
        "LGA", 
        null
    ], 
    [
        "I-1986090251", 
        "INDIANHEAD TRUCK LINE INC", 
        "CLARK OIL & REFINING CORP", 
        0.0, 
        "1986-08-19", 
        null, 
        ";", 
        "Punctured;", 
        "GASOLINE INCLUDES GASOLINE MIXED WITH ETHYL ALCOHOL  WITH NOT MORE THAN 10% ALCOHOL", 
        8201.0, 
        "LGA", 
        "THE UNIT WAS SOUTHBOUND ON 169 WHEN IT STRUCK A DIVIDER BETWEEN LANES; THE UNIT THEN WENT OFF ONTO THE SOFT SHOULDER TO THE RIGHT AND THE TRAILER ROLL ED OVER.  IT WAS PUNCTURED BY A POWER POLE OR FIRE HYDRANT AND WAS IGNITED BY THE POWER LINES WHEN GASOLINE WAS SPILLING OUT.  THE DRIVER WAS BURNED O VER 95% OF HIS BODY AND DIED OF HIS INJURIED ON 8/31/86.  THE TRACTOR AND T RAILER WERE A TOTAL LOSS.  THE GASOLINE RAN INTO THE DITCH AND WAS BURNED O R SOAKED INTO THE SOIL.  THE CONTAMINATED SOIL WAS TESTED AND HAUYLED TO A LANDFILL AND REPLACED BY GOOD SOIL."
    ], 
    [
        "I-1986100283", 
        "INDIANHEAD TRUCK LINE INC", 
        "CLARK OIL & REFINING CORP", 
        0.0, 
        "1986-08-31", 
        null, 
        ";", 
        "Punctured;", 
        "GASOLINE INCLUDES GASOLINE MIXED WITH ETHYL ALCOHOL  WITH NOT MORE THAN 10% ALCOHOL", 
        8604.0, 
        "LGA", 
        "OUR DRIVER WAS PROCEEDING SOUTHBOUND ON HIGHWAY 52 WHEN A CAR WESTBOUND ON COUNTY ROAD 47 PULLED IN FRONT OF THE TRUCK.  THE DRIVER TRIED TO AVOID A B ROADSIDE COLLLISION  STRUCK THE CAR AND FLIPPED OVER IN THE ROAD  THE TANK SPILT OPEN  WHICH WAS IGNITED ALMOST IMMEDIATELY.  THE DRIVER DIED OF SEVER E BURNS SEVERAL DAYS LATER.  A WOMAN PASSENGER HAD A MINOR INJURY  THE DRIV ER NOT INJURED.  THE 80 YEAR OLD DRIVER OF THE CAR TOLD POLICE HE DID NOT L OOK BEFORE PULLING INTO THE PATH OF THE TRUCK.  SOME OF THE PRODUCT LEAKED INTO THE DITCH WHICH IS TO BE DISPOSED OF THROUGH LANDFILL.  CLEAN SOIL WIL L BE BROUGHT INTO REPLACE IT."
    ], 
    [
        "E-2012120064", 
        "WESTERN COOP TRANSPORT ASSOCIATION", 
        "CF INDUSTRIES  INC.", 
        18000.0, 
        "2012-11-08", 
        "1300", 
        "Gasket", 
        "Torn Off or Damaged", 
        "AMMONIA ANHYDROUS", 
        478.2402, 
        "GCF", 
        "The semi was passing a farm tractor.  When the semi and half of the tank was past the farm tractor  the tractor driver turned left and hit the side of the tank.  The farmer was trying to turn into a field approach.    The farm tractor forced the semi and tank off the road and into a ditch.  The tank separated from the semi and rolled over several times.  The semi then went into the ditch and rolled over.      The piping on the discharge side of the pump was torn off and a gasket inside the internal vavle ripped and stuck inside the valve preventing it from closing completely.  Anhydrous released and blew toward the semi where the driver was unconscious.    A water fog was sprayed onto the leaking anhydrous but the cold weather made the release slow until it was barely noticable allowing responders to approach the tank and install a valve on the pump discharg to eliminate the release."
    ], 
    [
        "E-2013050557", 
        "JENSEN TRANSPORT INC", 
        "DASCO INCORPORATED", 
        1150000.0, 
        "2013-05-07", 
        "930", 
        "Basic Material", 
        "Torn Off or Damaged", 
        "AMMONIA ANHYDROUS", 
        334.2, 
        "GCF", 
        "According to the information obtatined  the following occurred.  While traveling  Jensen Transport vehicle was clipped by a train  which caused truck to rollover onto its side and release product.  The capacity of the tanker is 40 000 pounds.  The Local Fire Department responded to apply water to the overturned tanker and reduce vapor cloud emitting from the cargo tank.  Immediate area was evacuated as a precautionary measure  due to the heavy vapors.  Swift County Emergency Management Agency and Chemical Assessment Team responded to assess the site  along with the Minnesota Department of Agriculture.  West Central Environmental Consultants of Morris  Minnesota was dispatched to assist in cleanup.  Burlington Northern Sante Fe Railyard contracted Specialized Response Solutions (SRS) to transfer product from the damaged tanker  into a rescue tanker provided by Jensen Transport.   Approximately 20 000 pounds of anhydrous ammonia were recovered into the rescue tanker.  The Local Fire Department continued to spray water onto the damaged tank until no further vapors were released.  West Central Environmental Consultants proceeded to recover the contaminated waters from the site.  Center for Toxicology and Environmental Health were on site to monitor the air and ensure safe levels within immediate area.  WCEC pulled soil samples from the adjacent soils in the area  per Minnesota DOT  and site will be monitored to ensure all levels of contamination have been recovered."
    ], 
    [
        "I-1997040840", 
        "MIELKE TRANSPORTATION INC", 
        "MINNESOTA CORN PROCESSORS  LLC", 
        109000.0, 
        "1997-04-17", 
        "1100", 
        "Basic Material; ;", 
        "Ripped or Torn; ;", 
        "ALCOHOLS  N.O.S.", 
        9600.0, 
        "LGA", 
        "TRUCK WAS TIPPED OVER WITH RESULTING FIRE.  DETAILS UNKNOWN AT THIS TIME."
    ], 
    [
        "I-2003110985", 
        "PAYNESVILLE FARMERS UNION CO-OP", 
        "PAYNESVILLE FARMERS UNION CO-OP", 
        0.0, 
        "2003-11-04", 
        "1000", 
        null, 
        null, 
        "AMMONIA ANHYDROUS", 
        0.06684, 
        "GCF", 
        "*EMPLOYEE WAS DONE FILLING NURSE TANK FROM STORAGE TANK; CLOSED RISER VALVES.  CLOSED NURSE TANK LIQUID VALVE AND DISCONNECTED HOSE - WITH OUT CONFUMATION - EMPLOYEE FORGOT TO CLOSE HOSE END VALVE AND PRODUCT FROM HOSE SPLASHED IN HIS UPPER LEFT CHEST AREA  NECK AND FACE."
    ], 
    [
        "I-1979101641", 
        "C F INDUSTRIES INC", 
        "CF INDUSTRIES  INC.", 
        0.0, 
        "1979-09-27", 
        null, 
        "Auxiliary Valve; Closure (e.g.  Cap  Top  or Plug); Piping or Fittings", 
        "Burst or Ruptured; ;", 
        "AMMONIA ANHYDROUS", 
        40120.0, 
        "LGA", 
        null
    ]
]