[
    [
        "I-2001011039", 
        "CANADIAN PACIFIC LTD", 
        "SHELL CANADA LTD", 
        1600000.0, 
        "2000-12-18", 
        "715", 
        "Basic Material", 
        "Punctured", 
        "SULFUR  MOLTEN", 
        10000.0, 
        "LGA", 
        "TWENTY EIGHT CAR DERAILRMENT DUE TO POSSIBLE WHEEL METAL FATIGUE -- PENDING FURTHER INVESTIGATION.  SEVEN TANK CARS AND TWENTY EIGHT TANK CARS DERAILED CONTIANED MOLTEN SULPHUR THAT WERE PUNCTURED VIA PIECES OF RAIL AND/OR OTHER TANK CAR COUPLERS DURING THE INCIDENT. MOLTEN SULFUR THAT WAS RELEASED SOLIDIFIED IMMEDIATELY DUE TO INCLIMATE WEATHER (-15 F).  HOWEVER  TANK CAR PROX 006000 RELEASED VAPORS WHICH IGNITED ON ADJACENT SOIL SURFACES.  FIRE SUPPRESSION INCLUDED A LIGHT FOG TO COOL THE MOLTEN SULFUR AND TO EXTINGUISH ALL POTENTIAL REFLASH.  TWENTY SIX OF THE DERAILED TANK CARS WERE RELOCATED TO A STAGING AREA - AWAITNG DISPOSAL.  IMPACTED SOIL/RECOVERED SULPHUR WILL BE DISPOSED OF IN SAME MANNER AS TANK CARS - WITHIN ALL APPLICABLE REGULATIONS AT A REGIONAL LANDFILL. SITE RESTORATION AND DISPOSAL WILL COMMENCE WHEN WEATHER PERMITS AND ACCESS CAN BE CONSTRUCTED."
    ], 
    [
        "I-2001011039", 
        "CANADIAN PACIFIC LTD", 
        "SHELL CANADA LTD", 
        1600000.0, 
        "2000-12-18", 
        "715", 
        "Basic Material;", 
        "Punctured; Crushed", 
        "SULFUR  MOLTEN", 
        10000.0, 
        "LGA", 
        "TWENTY EIGHT CAR DERAILRMENT DUE TO POSSIBLE WHEEL METAL FATIGUE -- PENDING FURTHER INVESTIGATION.  SEVEN TANK CARS AND TWENTY EIGHT TANK CARS DERAILED CONTIANED MOLTEN SULPHUR THAT WERE PUNCTURED VIA PIECES OF RAIL AND/OR OTHER TANK CAR COUPLERS DURING THE INCIDENT. MOLTEN SULFUR THAT WAS RELEASED SOLIDIFIED IMMEDIATELY DUE TO INCLIMATE WEATHER (-15 F).  HOWEVER  TANK CAR PROX 006000 RELEASED VAPORS WHICH IGNITED ON ADJACENT SOIL SURFACES.  FIRE SUPPRESSION INCLUDED A LIGHT FOG TO COOL THE MOLTEN SULFUR AND TO EXTINGUISH ALL POTENTIAL REFLASH.  TWENTY SIX OF THE DERAILED TANK CARS WERE RELOCATED TO A STAGING AREA - AWAITNG DISPOSAL.  IMPACTED SOIL/RECOVERED SULPHUR WILL BE DISPOSED OF IN SAME MANNER AS TANK CARS - WITHIN ALL APPLICABLE REGULATIONS AT A REGIONAL LANDFILL. SITE RESTORATION AND DISPOSAL WILL COMMENCE WHEN WEATHER PERMITS AND ACCESS CAN BE CONSTRUCTED."
    ], 
    [
        "I-1992010157", 
        "GROVER-LINDBERG DISTRIBUTING  INC.", 
        "SHELL OIL CO", 
        1550312.0, 
        "1991-12-05", 
        "1415", 
        ";", 
        "Punctured;", 
        "ETHANOL OR ETHYL ALCOHOL OR ETHANOL SOLUTIONS OR ETHYL ALCOHOL SOLUTIONS", 
        380.0, 
        "LGA", 
        "THE TRAIL COLLIDED WITH THE VEHICLE WHICH BURST INTO FLAMES AT THE CROSSING AT HIGHWAY 4 IN GREENBUSH  MINNESOTA.  THE TRAIN PUSHED THE TRUCK ABOUT 400 FEET DOWN THE TRACK BEFORE COMING TO A STOP.  AS A RESULT OF THE IMPACT THE PRODUCT IN THE TANK DISPERSED ALONG THE RIGHT-OF-WAY.  (MSC-50T SUMBITTED ON 1/2/92)."
    ], 
    [
        "I-1992010157", 
        "GROVER-LINDBERG DISTRIBUTING  INC.", 
        "SHELL OIL CO", 
        1550312.0, 
        "1991-12-05", 
        "1415", 
        ";", 
        "Punctured;", 
        "GASOLINE INCLUDES GASOLINE MIXED WITH ETHYL ALCOHOL  WITH NOT MORE THAN 10% ALCOHOL", 
        4919.0, 
        "LGA", 
        "THE TRAIL COLLIDED WITH THE VEHICLE WHICH BURST INTO FLAMES AT THE CROSSING AT HIGHWAY 4 IN GREENBUSH  MINNESOTA.  THE TRAIN PUSHED THE TRUCK ABOUT 400 FEET DOWN THE TRACK BEFORE COMING TO A STOP.  AS A RESULT OF THE IMPACT THE PRODUCT IN THE TANK DISPERSED ALONG THE RIGHT-OF-WAY.  (MSC-50T SUMBITTED ON 1/2/92)."
    ], 
    [
        "I-1992010157", 
        "GROVER-LINDBERG DISTRIBUTING  INC.", 
        "SHELL OIL CO", 
        1550312.0, 
        "1991-12-05", 
        "1415", 
        ";", 
        "Punctured;", 
        "FUEL OIL  NO. 1  2  4  5  OR 6", 
        2204.0, 
        "LGA", 
        "THE TRAIL COLLIDED WITH THE VEHICLE WHICH BURST INTO FLAMES AT THE CROSSING AT HIGHWAY 4 IN GREENBUSH  MINNESOTA.  THE TRAIN PUSHED THE TRUCK ABOUT 400 FEET DOWN THE TRACK BEFORE COMING TO A STOP.  AS A RESULT OF THE IMPACT THE PRODUCT IN THE TANK DISPERSED ALONG THE RIGHT-OF-WAY.  (MSC-50T SUMBITTED ON 1/2/92)."
    ], 
    [
        "E-2013050557", 
        "JENSEN TRANSPORT INC", 
        "DASCO INCORPORATED", 
        1150000.0, 
        "2013-05-07", 
        "930", 
        "Basic Material", 
        "Torn Off or Damaged", 
        "AMMONIA ANHYDROUS", 
        334.2, 
        "GCF", 
        "According to the information obtatined  the following occurred.  While traveling  Jensen Transport vehicle was clipped by a train  which caused truck to rollover onto its side and release product.  The capacity of the tanker is 40 000 pounds.  The Local Fire Department responded to apply water to the overturned tanker and reduce vapor cloud emitting from the cargo tank.  Immediate area was evacuated as a precautionary measure  due to the heavy vapors.  Swift County Emergency Management Agency and Chemical Assessment Team responded to assess the site  along with the Minnesota Department of Agriculture.  West Central Environmental Consultants of Morris  Minnesota was dispatched to assist in cleanup.  Burlington Northern Sante Fe Railyard contracted Specialized Response Solutions (SRS) to transfer product from the damaged tanker  into a rescue tanker provided by Jensen Transport.   Approximately 20 000 pounds of anhydrous ammonia were recovered into the rescue tanker.  The Local Fire Department continued to spray water onto the damaged tank until no further vapors were released.  West Central Environmental Consultants proceeded to recover the contaminated waters from the site.  Center for Toxicology and Environmental Health were on site to monitor the air and ensure safe levels within immediate area.  WCEC pulled soil samples from the adjacent soils in the area  per Minnesota DOT  and site will be monitored to ensure all levels of contamination have been recovered."
    ], 
    [
        "I-2007010319", 
        "DAKOTA  MINNESOTA & EASTERN RAILROAD CORPORATION", 
        "VERASUN ENERBY", 
        436369.0, 
        "2006-11-22", 
        "2030", 
        null, 
        null, 
        "ALCOHOLS  N.O.S.", 
        24877.0, 
        "LGA", 
        "DAKOTA  MINNESOTA & EASTERN RAILROD TRAIN #EAUCC-22 WAS EASTBOUND AT A RECORDED SPEED OF 24 MPH AT MILEPOST 157.75 WHEN IT ENCOUNTERED BROKEN RAIL.  SEVEN TANK CARS CONTAINING ETHANOL DERAILED WITH ALL BUT ONE CAR LEAVING THE RAIL.  THE FINAL CAR IN THE DERAILMENT CAME TO REST IN AN UPRIGHT POSITION ON A WOOD CONSTRUCTION BRIDGE.  THE TRAIN CREW BEGAN AN INSPECTION OF THE UNDESIRED EMERGENCY.  THEY SMELLED ETHYL ALCOHOL (ETHANOL) AND CONTACTED DISPATCH AND THE LOCAL EMERGENY RESPONSE TEAM.  AS INFORMATION FROM THE SCENE WAS RELAYED THROUGH DISPATCH  FORCES WERE DISPATCHED INCLUDING  LOCAL FIRE  AMBULANCE  LAW  DM&E'S HAZ-MAT MANAGER  MINNESTOA REGIONAL HAZ-MAT RESPONSE  CONTRACT HAZ-MAT RESPONDERS  ENVIRONMENTAL RESPONSE ENGINEERS  AND A RE-RAILING CONTRACTOR.  INITIAL DAMAGE ASSESSMENT INDICATED AT LEAST THREE CARS LEAKING PRODUCT TO THE GROUND.  THE AREA WAS A DRY CREEK BED.  TANK CAR ACFX 200406 WAS ON ITS SIDE WITH THE FILL VALVE BROKEN AND A SMALL PUNCUTRE IN THE MAN WAY COVER.  BOTH OF THESE LEAKS WERE GIVEN A TEMPORARY REPAIR WITH PLUGS AND PLUG AND PATCH MATERIAL.  TANK CAR RTMX 30684 WAS ON ITS SIDE LEAKING A SMALL AMOUNT OF PRODUCT FROM THE MAN WAY.  BOLTS WERE TIGHTENED.  TANK CAR GATX 35196 WAS UPRIGHT ON THE TRACK STRUCTURE  AT ABOUT A 20 DEGREE ANGLE WITH A 2 INCH GASH IN THE HEAD SHELL.  PLUGS AND PLUG AND DIKE WERE APPLIED.  DURING OUR SECOND DAMAGE ASSESSMENT  TANK CAR UTLX 46755 WAS NOTED UPRIGHT ON A BRIDGE LEAKING FROM AN UNKNOWN SOURCE.  IT WAS LATER DISCOVERED TO BE THE MAN WAY GASKET.  THE CAR WAS AT AN ANGLE ON THE BRIDGE THAT THE LEAK STOPPED ITSELF PRIOR TO SUNRISE.  EQUIPMENT AND MANPOWER WAS BROUGHT TO THE SITE THROUGOUT THE NIGHT AND EARLY MORNING.  THE CARS WERE MONITORED FOR FURTHER LEAKAGE  AIR MONITORING CONTINUED  AN EVACUATION OF 12 CITIZENS TOOK PLACE.  REMAINING PRODUCT WAS TRANS-LOADED TO RAILCARS.  ALL PRODUCT ON THE GROUND WAS VACUUMED AND SENT TO A DESTRUCTION FACILITY. FINAL TRANS-LOADING WAS COMPLETED ON NOVEMBER 25  2006 AT 2100 HRS.  TOTAL PRODUCT SPILLED WAS 24 877 GALLONS OF WHICH 11 807 GALLONS WERE RECOVERED AND DISPOSED OF IN ACCORDANCE WITH REGULATIONS."
    ], 
    [
        "I-1996040591", 
        "BURLINGTON NORTHERN (MANITOBA) LIMITED", 
        "SASKFERO PRODUCTS INC", 
        436000.0, 
        "1996-02-28", 
        "1128", 
        "Basic Material", 
        "Punctured", 
        "AMMONIA  ANHYDROUS  LIQUEFIED OR AMMONIA SOLUTIONS RELATIVE DENSITY LESS THAN .880 AT 15 DEGREES C IN WATER  WITH MORE THAN 50 PERCENT AMMONIA", 
        15000.0, 
        "LGA", 
        "ON FEBRUARY 28  1996  AT 1128 TRAIN 01808 TRAVELING AT 50 MPH DERAILED 25 CARS INCLUDING FOUR (4) CARS OF AMMONIA ANHYDROUS  LIQUEFIED  2.4  UN1005 (NCTX33052  PLMX4520 PROX38044 AND CGTX63726) AND TWO (2) CARS OF PETROLEUM GASES  LIQUEFIED  2.1  UN1075 (PROX29369 AND PROX29626).  tWO CARS PROX29626 AND CGTX63726 DEVELOPED LEAKS DUE TO PUNCTURES NEAR THE HEAD OF THE CAR.  HAZARDOUS MATERIAL TEAMS WERE NOTIFIED AND RESPONDED. THE PRODUCT FROM NCTX 33052  PLMX4520  PROX38044  PROX29363 AND THE PRODUCT REMAINING IN CGTX63726 WAS TRANSFERRED INTO HIGHWAY TRANSPORTS. THE PRODUCT REMAINING IN PROX 29626 WAS CONSUMED IN A LIQUID FIRE. ON FEBRUARY 28  1996  AT 1128 TRAIN 01909 TRAVELING AT 50 MPH DERAILED 25 CARS INCLUDING FOUR (4) CARS CONTAINING AMMONIA  ANHYDROUS  LIQUEFIED  2.4  UN1005 (PLMX4520  CGTX63726  PROX38044 AND NCTX33052) AND TWO CARS CONTAINING PETROLEUM GASES  LIQUEFIED  2.1  UN1075 (PROX29626 AND PROX29369).  TANK CARS PROX29626 AND CGTX63726 DEVELOPED LEAKS DUE TO PUNCTURES NEAR THE HEAD OF THE CARS.  HAZARDOUS MATERIAL TEAMS WERE NOTIFIED AND RESPONDED.  THE PRODUCT FROM CARS PROX38044  NCTX33052  PROX29369  PLMX4920 AND THE PRODUCT REMAINING IN CGTX63726 WAS TRANSFERRED TO HIGHWAY TRANSPORTS.  THE PETROLEUM GAS IN PROX29626 WAS CONSUMED IN A LIQUID FIRE."
    ], 
    [
        "I-1996040591", 
        "BURLINGTON NORTHERN (MANITOBA) LIMITED", 
        "PETRO CANADA", 
        436000.0, 
        "1996-02-28", 
        "1128", 
        "Basic Material", 
        "Punctured", 
        "PETROLEUM GASES  LIQUEFIED OR LIQUEFIED PETROLEUM GAS", 
        16875.0, 
        "LGA", 
        "ON FEBRUARY 28  1996  AT 1128 TRAIN 01808 TRAVELING AT 50 MPH DERAILED 25 CARS INCLUDING FOUR (4) CARS OF AMMONIA ANHYDROUS  LIQUEFIED  2.4  UN1005 (NCTX33052  PLMX4520 PROX38044 AND CGTX63726) AND TWO (2) CARS OF PETROLEUM GASES  LIQUEFIED  2.1  UN1075 (PROX29369 AND PROX29626).  tWO CARS PROX29626 AND CGTX63726 DEVELOPED LEAKS DUE TO PUNCTURES NEAR THE HEAD OF THE CAR.  HAZARDOUS MATERIAL TEAMS WERE NOTIFIED AND RESPONDED. THE PRODUCT FROM NCTX 33052  PLMX4520  PROX38044  PROX29363 AND THE PRODUCT REMAINING IN CGTX63726 WAS TRANSFERRED INTO HIGHWAY TRANSPORTS. THE PRODUCT REMAINING IN PROX 29626 WAS CONSUMED IN A LIQUID FIRE. ON FEBRUARY 28  1996  AT 1128 TRAIN 01909 TRAVELING AT 50 MPH DERAILED 25 CARS INCLUDING FOUR (4) CARS CONTAINING AMMONIA  ANHYDROUS  LIQUEFIED  2.4  UN1005 (PLMX4520  CGTX63726  PROX38044 AND NCTX33052) AND TWO CARS CONTAINING PETROLEUM GASES  LIQUEFIED  2.1  UN1075 (PROX29626 AND PROX29369).  TANK CARS PROX29626 AND CGTX63726 DEVELOPED LEAKS DUE TO PUNCTURES NEAR THE HEAD OF THE CARS.  HAZARDOUS MATERIAL TEAMS WERE NOTIFIED AND RESPONDED.  THE PRODUCT FROM CARS PROX38044  NCTX33052  PROX29369  PLMX4920 AND THE PRODUCT REMAINING IN CGTX63726 WAS TRANSFERRED TO HIGHWAY TRANSPORTS.  THE PETROLEUM GAS IN PROX29626 WAS CONSUMED IN A LIQUID FIRE."
    ], 
    [
        "I-1995100148", 
        "EDWARDS OIL COMPANY  INC.", 
        "EDWARDS OIL INC", 
        243000.0, 
        "1995-05-13", 
        "400", 
        ";", 
        "Punctured;", 
        "FUEL OIL (NO. 1  2  4  5  OR 6)", 
        0.0, 
        null, 
        "DRIVER EXITING A TUNNEL GOING UPHILL.  ROAD MAKES AN S TURN  LOAD SHIFTED AND STARTED ROLLING OFF OF CARGO TANK."
    ]
]