[
    {
        "Rpt_Num": "E-2011010088", 
        "Tot_Hazmat_Inj": 55.0, 
        "Inc_St": "MN", 
        "Tot_Hazmat_Fatal": 0.0, 
        "What_Failed_Desc": "Closure (e.g.  Cap  Top  or Plug)", 
        "Mode_Transpo": "Highway", 
        "Date_Inc": "2010-12-08", 
        "Ship_Name": "CHS INC.", 
        "How_Failed_Desc": "Vented", 
        "C_R_Name": "WESTERN COOP TRANSPORT ASSOCIATION", 
        "Quant_Released": 11100.0, 
        "Commod_Long_Name": "AMMONIA ANHYDROUS", 
        "Time_Inc": "745", 
        "Desc_of_Events": "Driver was unloading anhydrous ammonia into an 18 000 gallon above ground storage tank.  The customer had ordered four loads.  The driver started to unload the product and saw vapor coming from the storage tank.  He immediately shut down the truck pump and notified the customer who then closed a valve on the storag tank where they had removed a pump.", 
        "Unit_of_Measure": "GCF", 
        "Inc_City": "RANDOLPH", 
        "Tot_Amt_of_Damages": 0.0, 
        "Explosion_Result_Ind": "No", 
        "Tot_Evac": 500.0, 
        "Inc_Zip": "55065"
    }, 
    {
        "Rpt_Num": "E-2013050557", 
        "Tot_Hazmat_Inj": 7.0, 
        "Inc_St": "MN", 
        "Tot_Hazmat_Fatal": 1.0, 
        "What_Failed_Desc": "Basic Material", 
        "Mode_Transpo": "Highway", 
        "Date_Inc": "2013-05-07", 
        "Ship_Name": "DASCO INCORPORATED", 
        "How_Failed_Desc": "Torn Off or Damaged", 
        "C_R_Name": "JENSEN TRANSPORT INC", 
        "Quant_Released": 334.2, 
        "Commod_Long_Name": "AMMONIA ANHYDROUS", 
        "Time_Inc": "930", 
        "Desc_of_Events": "According to the information obtatined  the following occurred.  While traveling  Jensen Transport vehicle was clipped by a train  which caused truck to rollover onto its side and release product.  The capacity of the tanker is 40 000 pounds.  The Local Fire Department responded to apply water to the overturned tanker and reduce vapor cloud emitting from the cargo tank.  Immediate area was evacuated as a precautionary measure  due to the heavy vapors.  Swift County Emergency Management Agency and Chemical Assessment Team responded to assess the site  along with the Minnesota Department of Agriculture.  West Central Environmental Consultants of Morris  Minnesota was dispatched to assist in cleanup.  Burlington Northern Sante Fe Railyard contracted Specialized Response Solutions (SRS) to transfer product from the damaged tanker  into a rescue tanker provided by Jensen Transport.   Approximately 20 000 pounds of anhydrous ammonia were recovered into the rescue tanker.  The Local Fire Department continued to spray water onto the damaged tank until no further vapors were released.  West Central Environmental Consultants proceeded to recover the contaminated waters from the site.  Center for Toxicology and Environmental Health were on site to monitor the air and ensure safe levels within immediate area.  WCEC pulled soil samples from the adjacent soils in the area  per Minnesota DOT  and site will be monitored to ensure all levels of contamination have been recovered.", 
        "Unit_of_Measure": "GCF", 
        "Inc_City": "MURDOCK", 
        "Tot_Amt_of_Damages": 1150000.0, 
        "Explosion_Result_Ind": "No", 
        "Tot_Evac": 5.0, 
        "Inc_Zip": "56271"
    }, 
    {
        "Rpt_Num": "E-2010070341", 
        "Tot_Hazmat_Inj": 4.0, 
        "Inc_St": "MN", 
        "Tot_Hazmat_Fatal": 0.0, 
        "What_Failed_Desc": "Inner Packaging", 
        "Mode_Transpo": "Highway", 
        "Date_Inc": "2010-07-19", 
        "Ship_Name": "SEACOLE-CRC  LLC", 
        "How_Failed_Desc": "Burst or Ruptured", 
        "C_R_Name": "DEE SPEE DELIVERY SERVICE INC", 
        "Quant_Released": 2.6418, 
        "Commod_Long_Name": "NITRIC ACID OTHER THAN RED FUMING  WITH AT LEAST 65 PERCENT  BUT NOT MORE THAN 70 PERCENT NITRIC ACID", 
        "Time_Inc": "1730", 
        "Desc_of_Events": "On July 19  2010 at approximately 19:30  while loading a trailer and employee dropped a package containing 2 - 2.5 liter glass bottles of nitric acid.  The inner packagings broke releasing the acid.  The acid reacted with the cardboard causing a brownish vapor.  The immediate supervisor put on a respirator and went in to apply a neutralizer to try and control the spill.  The fumes were still very strong  so the trailer was removed from the building and the fire department was contacted.  Upon arrival at approximately 20:00  the fire department was presented with the Hazardous Materials Shipping Papers for the load  to determine the hazard present.  Infotrac was notified at 20:52 and they contacted the shipper (Seacole) recommending that Bay West Environmental Services be contacted for the clean-up.  Bay West arrived at approximately 01:00 and started the clean-up and the fire department left the scene.  Bay West removed and washed or eliminated any contaminated packages that were in the trailer  then proceeded to wash out the trailer.  The scene was cleared at 05:15.", 
        "Unit_of_Measure": "LGA", 
        "Inc_City": "SAINT CLOUD", 
        "Tot_Amt_of_Damages": 10000.0, 
        "Explosion_Result_Ind": "No", 
        "Tot_Evac": 0.0, 
        "Inc_Zip": "56302-1417"
    }, 
    {
        "Rpt_Num": "E-2012050083", 
        "Tot_Hazmat_Inj": 3.0, 
        "Inc_St": "MN", 
        "Tot_Hazmat_Fatal": 0.0, 
        "What_Failed_Desc": "Fill Hole", 
        "Mode_Transpo": "Air", 
        "Date_Inc": "2012-05-02", 
        "Ship_Name": "INDIVIDUAL", 
        "How_Failed_Desc": "Failed to Operate", 
        "C_R_Name": "DELTA AIR LINES  INC.", 
        "Quant_Released": 1.0, 
        "Commod_Long_Name": "HYDROGEN PEROXIDE  AQUEOUS SOLUTIONS WITH NOT LESS THAN 20 PERCENT BUT NOT MORE THAN 40 PERCENT HYDROGEN PEROXIDE (STABILIZED AS NECESSARY)", 
        "Time_Inc": "1400", 
        "Desc_of_Events": "A 1 gallon bottle of 35% Hydrogen Peroxide (Guardian of Eden H2O2) was was discovered in a passenger's checked bag when it begin to leak as it was loaded on the aircraft. The bag was removed from the flight and caused a 30 minute delay.", 
        "Unit_of_Measure": "LGA", 
        "Inc_City": "MINNEAPOLIS", 
        "Tot_Amt_of_Damages": 0.0, 
        "Explosion_Result_Ind": "No", 
        "Tot_Evac": 0.0, 
        "Inc_Zip": "55450"
    }, 
    {
        "Rpt_Num": "I-2012110441", 
        "Tot_Hazmat_Inj": 1.0, 
        "Inc_St": "MN", 
        "Tot_Hazmat_Fatal": 0.0, 
        "What_Failed_Desc": null, 
        "Mode_Transpo": "Highway", 
        "Date_Inc": "2012-10-14", 
        "Ship_Name": "THE LUBRIZOL CORPORATION", 
        "How_Failed_Desc": "Vented", 
        "C_R_Name": "DISTTECH  INC.", 
        "Quant_Released": 400.0, 
        "Commod_Long_Name": "FLAMMABLE LIQUIDS  N.O.S.", 
        "Time_Inc": "345", 
        "Desc_of_Events": "THE DISTTECH  LLC DRIVER WAS ATTEMPTING TO DELIVER ULTRAZOL INTO THE CUSTOMER'S UNDERGROUND STORAGE TANK. THIS WAS A BRAND NEW STORAGE TANK THAT WAS JUST INSTALLED. THE COMPANY THAT INSTALLED THE TANK FAILED TO REMOVE A PLUG AFTER PERFORMING A PRESSURE TEST. AS A RESULT  PRESSURE IN THE TANK BUILT UP AND WHEN THE DRIVER UNHOOKED HIS HOSE AFTER MAKING THE DELIVERY APPROXIMATELY 400 GALLONS OF ULTRAZOL WAS RELEASED. THE DRIVER WAS SPRAYED IN THE EYE WITH THE ULTRAZOL AND SOUGHT TREATMENT AT A LOCAL EMERGENCY ROOM. HE WAS DIAGNOSED WITH CHEMICAL CONJUNCTIVITIS AND RELEASED. THE SPILL CLEAN-UP WAS HANDLED BY THE CUSTOMER.", 
        "Unit_of_Measure": "LGA", 
        "Inc_City": "BAXTER", 
        "Tot_Amt_of_Damages": 7200.0, 
        "Explosion_Result_Ind": "No", 
        "Tot_Evac": 0.0, 
        "Inc_Zip": "56425"
    }, 
    {
        "Rpt_Num": "I-2004100153", 
        "Tot_Hazmat_Inj": 1.0, 
        "Inc_St": "MN", 
        "Tot_Hazmat_Fatal": 0.0, 
        "What_Failed_Desc": null, 
        "Mode_Transpo": "Highway", 
        "Date_Inc": "2004-09-17", 
        "Ship_Name": "B P OIL CO (BRITISH PETROLEUM)", 
        "How_Failed_Desc": null, 
        "C_R_Name": "WAYNE TRANSPORTS  INC.", 
        "Quant_Released": 30.0, 
        "Commod_Long_Name": "GASOLINE INCLUDES GASOLINE MIXED WITH ETHYL ALCOHOL  WITH NOT MORE THAN 10% ALCOHOL", 
        "Time_Inc": "1530", 
        "Desc_of_Events": "DRIVE ERROR OPENED WRONG VALVE  DRIVER WAS SPRAYED IN FACE.  WENT TO HOSPITAL TO HAVE EYES FLUSHED.  SPREAD FLOOR DRY BY FIRE DEPT. CLEANED UP AND DISPOSED OF.  DRIVER RETRAINED", 
        "Unit_of_Measure": "LGA", 
        "Inc_City": "BROOKLYN PARK", 
        "Tot_Amt_of_Damages": 360.0, 
        "Explosion_Result_Ind": "No", 
        "Tot_Evac": 0.0, 
        "Inc_Zip": null
    }, 
    {
        "Rpt_Num": "I-2005030894", 
        "Tot_Hazmat_Inj": 1.0, 
        "Inc_St": "MN", 
        "Tot_Hazmat_Fatal": 0.0, 
        "What_Failed_Desc": "Inner Packaging", 
        "Mode_Transpo": "Highway", 
        "Date_Inc": "2005-01-04", 
        "Ship_Name": "SOUTHWEST MICROELECTRONIC MATERIALS  INC", 
        "How_Failed_Desc": "Gouged or Cut", 
        "C_R_Name": "UPS GROUND FREIGHT  INC.", 
        "Quant_Released": 1.0, 
        "Commod_Long_Name": "HYDROFLUORIC ACID SOLUTION", 
        "Time_Inc": "815", 
        "Desc_of_Events": "WHEN UNLOADING LINE HAVE UNIT IT WAS DISCOVERED THAT A SMALL SLIVER OF WOOD WENT THROUGH THE SIDE OF CARTON AND INTO ONE PLASTIC CONTAINER CONTAINING HAZ MAT.  THE SLIVER WAS ASSUMED TO BE FROM THE PALLET.", 
        "Unit_of_Measure": "LGA", 
        "Inc_City": "CIRCLE PINES", 
        "Tot_Amt_of_Damages": 5000.0, 
        "Explosion_Result_Ind": "No", 
        "Tot_Evac": 0.0, 
        "Inc_Zip": "55014"
    }, 
    {
        "Rpt_Num": "I-2001090302", 
        "Tot_Hazmat_Inj": 1.0, 
        "Inc_St": "MN", 
        "Tot_Hazmat_Fatal": 0.0, 
        "What_Failed_Desc": "Basic Material; Basic Material", 
        "Mode_Transpo": "Highway", 
        "Date_Inc": "2001-06-15", 
        "Ship_Name": "PRECISION LABORATORIES  LLC", 
        "How_Failed_Desc": "Cracked;", 
        "C_R_Name": "CON-WAY FREIGHT INC", 
        "Quant_Released": 0.5, 
        "Commod_Long_Name": "CORROSIVE LIQUID  BASIC  INORGANIC  N.O.S.", 
        "Time_Inc": "15", 
        "Desc_of_Events": "CARTON OF FREIGHT WAS LOADED IN TRAILER WITHOUT PROPER BLOCKING OF BRACING. TRAILER WAS HOSTLED TO A DIFFERENT DOOR.  THE CTN HIT INSIDE OF TRAILER AND JUG BROKE OPEN. DSR WHO LOADED FREIGHT RECEIVED INCIDENT LETTER.", 
        "Unit_of_Measure": "LGA", 
        "Inc_City": "FRIDLEY", 
        "Tot_Amt_of_Damages": 0.0, 
        "Explosion_Result_Ind": "No", 
        "Tot_Evac": 0.0, 
        "Inc_Zip": null
    }, 
    {
        "Rpt_Num": "I-2003110654", 
        "Tot_Hazmat_Inj": 1.0, 
        "Inc_St": "MN", 
        "Tot_Hazmat_Fatal": 0.0, 
        "What_Failed_Desc": "Auxiliary Valve; Piping or Fittings", 
        "Mode_Transpo": "Highway", 
        "Date_Inc": "2003-10-28", 
        "Ship_Name": "AGRILIANCE LLC", 
        "How_Failed_Desc": ";", 
        "C_R_Name": "WESTERN COOP TRANSPORT ASSOCIATION", 
        "Quant_Released": 0.0, 
        "Commod_Long_Name": "AMMONIA ANHYDROUS", 
        "Time_Inc": "2145", 
        "Desc_of_Events": "THE DRIVER OF AN MC331 ANHYDROUS AMMONIA TANKER WAS UNLOADING AT A BULK PLANT FACILITY.  HE HAD BEEN UNLOADING FOR 15-20 MINUTES WHEN PRODUCT STARTING COMING OUT OF A BLEEDER VALVE.  THE DRIVER SHUT DOWN THE VALVE. BUT INHALED A SMALL AMOUNT OF VAPORS.  DRIVER WAS TAKEN TO LOCAL HOSPITAL  TREATED & RELEASED.  ALL PROPER AUTHORITIES WERE CONTACTED AND THERE WAS NO PRODUCT CLEAN-UP NEEDED.  THE BLEEDER VALVE WAS REPLACED WITH A NEW ONE ON SITE.  A DOT INSPECTION WAS DONE AND NO FURTHER ACTION WAS NEEDED.", 
        "Unit_of_Measure": null, 
        "Inc_City": "HUTCHINSON", 
        "Tot_Amt_of_Damages": 0.0, 
        "Explosion_Result_Ind": "No", 
        "Tot_Evac": 0.0, 
        "Inc_Zip": null
    }, 
    {
        "Rpt_Num": "E-2005010067", 
        "Tot_Hazmat_Inj": 1.0, 
        "Inc_St": "MN", 
        "Tot_Hazmat_Fatal": 0.0, 
        "What_Failed_Desc": "Closure (e.g.  Cap  Top  or Plug)", 
        "Mode_Transpo": "Highway", 
        "Date_Inc": "2005-01-03", 
        "Ship_Name": "DIVERSEY  INC.", 
        "How_Failed_Desc": "Leaked", 
        "C_R_Name": "JEVIC TRANSPORTATION  INC", 
        "Quant_Released": 0.0625, 
        "Commod_Long_Name": "PHOSPHORIC ACID SOLUTION", 
        "Time_Inc": "1000", 
        "Desc_of_Events": "The carrier driver called into his dispatcher to report that he was making delivery to the consignee.  The shipment of drums had been tendered to Jevic Transportation on pallets.  The drums were removed from the pallets and put on the floor to facilitate cargo capacity in the trailer.  The consignee would not accept the shipment unless it was on pallets  but they would allow the driver to put the drums onto pallets from their stock.      While rolling the drums onto the pallets  the driver came into contact with some residue on the side of a drum containing phosphoric acid solution.  The driver was wearing gloves at the time.  The material wet the gloves and the calf area of his pants legs.  He washed the affected areas of his skin and contacted the HazMat Department of his company.  He stated that he did not feel any ill effects at the time  and wished to continue on his route.    He called again from his next stop reporting that he feels some burning sensation to the affected areas of his legs.  The Jevic HazMat Department directed him to go to a nearby medical facility for evaluation and possible treatment.  The driver was found by the hospital to have moderate acid burns to legs and thighs.", 
        "Unit_of_Measure": "LGA", 
        "Inc_City": "LONG PRAIRIE", 
        "Tot_Amt_of_Damages": 0.0, 
        "Explosion_Result_Ind": "No", 
        "Tot_Evac": 0.0, 
        "Inc_Zip": "56347"
    }
]