[
    [
        "I-1974010303", 
        "DAHLEN TRANSPORT INC", 
        "SKELLY OIL COMPANY*", 
        0.0, 
        "1974-01-11", 
        null, 
        null, 
        null, 
        "PETROLEUM GASES  LIQUEFIED OR LIQUEFIED PETROLEUM GAS", 
        0.0, 
        null, 
        null
    ], 
    [
        "I-1976080745", 
        "CONSOLIDATED FRGHTWYS CORP DEL", 
        "FMC CORP", 
        0.0, 
        "1976-08-10", 
        null, 
        null, 
        "Punctured", 
        "HYDROGEN PEROXIDE  AQUEOUS SOLUTIONS WITH NOT LESS THAN 20 PERCENT BUT NOT MORE THAN 40 PERCENT HYDROGEN PEROXIDE (STABILIZED AS NECESSARY)", 
        23.0, 
        "LGA", 
        null
    ], 
    [
        "I-1977051410", 
        "AMOCO OIL CO.", 
        "B P AMOCO OIL INC", 
        0.0, 
        "1977-05-17", 
        null, 
        null, 
        null, 
        "GASOLINE INCLUDES GASOLINE MIXED WITH ETHYL ALCOHOL  WITH NOT MORE THAN 10% ALCOHOL", 
        200.0, 
        "LGA", 
        null
    ], 
    [
        "I-1992010157", 
        "GROVER-LINDBERG DISTRIBUTING  INC.", 
        "SHELL OIL CO", 
        1550312.0, 
        "1991-12-05", 
        "1415", 
        ";", 
        "Punctured;", 
        "ETHANOL OR ETHYL ALCOHOL OR ETHANOL SOLUTIONS OR ETHYL ALCOHOL SOLUTIONS", 
        380.0, 
        "LGA", 
        "THE TRAIL COLLIDED WITH THE VEHICLE WHICH BURST INTO FLAMES AT THE CROSSING AT HIGHWAY 4 IN GREENBUSH  MINNESOTA.  THE TRAIN PUSHED THE TRUCK ABOUT 400 FEET DOWN THE TRACK BEFORE COMING TO A STOP.  AS A RESULT OF THE IMPACT THE PRODUCT IN THE TANK DISPERSED ALONG THE RIGHT-OF-WAY.  (MSC-50T SUMBITTED ON 1/2/92)."
    ], 
    [
        "I-1992010157", 
        "GROVER-LINDBERG DISTRIBUTING  INC.", 
        "SHELL OIL CO", 
        1550312.0, 
        "1991-12-05", 
        "1415", 
        ";", 
        "Punctured;", 
        "GASOLINE INCLUDES GASOLINE MIXED WITH ETHYL ALCOHOL  WITH NOT MORE THAN 10% ALCOHOL", 
        4919.0, 
        "LGA", 
        "THE TRAIL COLLIDED WITH THE VEHICLE WHICH BURST INTO FLAMES AT THE CROSSING AT HIGHWAY 4 IN GREENBUSH  MINNESOTA.  THE TRAIN PUSHED THE TRUCK ABOUT 400 FEET DOWN THE TRACK BEFORE COMING TO A STOP.  AS A RESULT OF THE IMPACT THE PRODUCT IN THE TANK DISPERSED ALONG THE RIGHT-OF-WAY.  (MSC-50T SUMBITTED ON 1/2/92)."
    ], 
    [
        "I-1992010157", 
        "GROVER-LINDBERG DISTRIBUTING  INC.", 
        "SHELL OIL CO", 
        1550312.0, 
        "1991-12-05", 
        "1415", 
        ";", 
        "Punctured;", 
        "FUEL OIL  NO. 1  2  4  5  OR 6", 
        2204.0, 
        "LGA", 
        "THE TRAIL COLLIDED WITH THE VEHICLE WHICH BURST INTO FLAMES AT THE CROSSING AT HIGHWAY 4 IN GREENBUSH  MINNESOTA.  THE TRAIN PUSHED THE TRUCK ABOUT 400 FEET DOWN THE TRACK BEFORE COMING TO A STOP.  AS A RESULT OF THE IMPACT THE PRODUCT IN THE TANK DISPERSED ALONG THE RIGHT-OF-WAY.  (MSC-50T SUMBITTED ON 1/2/92)."
    ], 
    [
        "I-1993120666", 
        "ONTARIO INC", 
        "CALUMET SPECIALTY PRODUCTS PARTNERS  L.P.", 
        130338.0, 
        "1993-03-21", 
        "345", 
        "Basic Material;", 
        ";", 
        "GASOLINE INCLUDES GASOLINE MIXED WITH ETHYL ALCOHOL  WITH NOT MORE THAN 10% ALCOHOL", 
        8412.0, 
        "LGA", 
        "THE DRIVER WAS TRAVELING NORTH ON HIGHWAY 61 ON HIS RETURN TRIP TO THUNDER BAY FROM SUPERIOR WINCONSIN WITH A LOAD OF UNLEADED FUEL.  AT AROUND SCHROEDER MINNESOTA HE OBSERVED THAT IT WAS SNOWING AND BY THE TIME HE PASSED THROUGH TOFTE HE DECIDED TO PULL OFF THE ROAD AND WAIT OUT THE STROM.  APPROXIMATELY TWO MILES NORTH OF TOFTE HE OBSERVED A SIGN FOR A REST AREA AHEAD ON THE RIGHT HAND SIDE OF THE ROAD.  HE SLOWED HIS VEHICLE TO A CRAWL AND STARTED TO ENTER THE REST AREA WHEN HE FELT A TUG FROM THE RIGHT REAR OF THE TRAILER.  WHEN HE LOOKED IN HIS MIRROR HE NOTICED THAT THE TRAILER WHEELS WERE SLIDING TO THE RIGHT DOWN A BANK AND THE TRACTOR AND TRAILER STARTED PULLING BACKWARD.  THE TRACTOR AND TRAILER BOTH ROLLED OVER LANDING ON THE ROOF.  THE FORCE OF THE IMPACT CAUSED THE WINDOWS ON THE TRUCK TO POP OUT.  THE DRIVER THEN TURNED OFF THE LIGHTS AND IGNITION AND CRAWLED OUT.  ONCE CLEAR OF THE CAB THE DRIVER NOTICED THAT THE BOTTOM OF THE TRACTOR AND TRAILER WERE ON FIRE.  HE ATTEMPTED TO RETRIEVE THE EXTINGUISHER BUT COULD NOT REACH IT.  AS HE CLIMBED BACK ONTO THE HIGHWAY A VEHICLE CAME ALONG WHICH TURNED OUT TO BE THE SON OF THE FIRE WARDEN.  HE CLIMBED INTO THE VEHICLE AND THEY DROVE A QUARTER MILE TO THE FIRE WARDENS HOUSE.  THE TOFTE AND OTHER AREA FIRE DEPARTMENT RESPONDED TO THE SCENE OF THE ACCIDENT.  THE FUEL FROM THE TANKER FLOWED DOWN A DITCH TOWARDED LAKE SUPERIOR CAUSING A FEW TREES TO BURN AS WELL AS SOME GRASS AND SHRUB BRUSH.  AT SOME POINT THE DECISION WAS MADE TO LET THE FUEL BURN RATHER THAN LET IT FLOW INTO THE LAKE.  A CALL WAS PLACED TO MURPHY OIL AND THEY CONTACTED OSI TO RESPOND TO THE SPILL.  THE MINNESOTA POLLUTION CONTROL AGENCY WAS CONTACTED AND THEY CALLED IN THE COAST GUARD AS WELL AS DISPATCHING A REPRESENTATIVE FROM MINNEAPOLIS.  THE COAST GUARD WAS LATER CANCELLED.  THE OSI TEAM RESPONDED AND CONTACTED A LOCAL EQUIPMENT OPERATOR TO DIG SEVERAL DITCHES WHERE THEY PLACED BOOMS TO CONTROL ANY FUEL THAT WAS HEADING FOR LAKE SUPERIOR.  THEY THEN CONTINUED TO CONTAIN THE AREA AND PROCEEDED WITH THE CLEANUP.  THEY WERE INFORMED AT THE SCENE TO CONTINUE WITH THEIR CLEANUP TO THE SATISFACTION OF THE MINNESOTA POLLUTION CONTROL AGENCY.  A CALL WAS ALSO PLACED TO THE NATIONAL RESPONSE CENTRE  REPORT NO 163294 REFERS.  THEY INFORMED US THAT THEY WOULD ENSURE THAT ALL AGENCIES WERE NOTIFIED."
    ], 
    [
        "I-2001040716", 
        "WAYNE TRANSPORTS  INC.", 
        "KOCK PETROLEUM GROUP", 
        0.0, 
        "2001-03-24", 
        "1815", 
        null, 
        null, 
        "DIESEL FUEL", 
        0.0, 
        null, 
        "THE CAUSE IS STILL UNDER INVESTIGATION.  TRAILER EXPLODED WHILE LOADING. MAY HAVE BEEN CAUSED BY STATIC ELECTRIC.  THERE WAS SOME DAMAGE TO THE ROOF OF LOAD FACILITY.  NO MAJOR FIRE BUT TRAILER IS A COMPLETE LOSS DUE TO EXTERNAL DAMAGE.  ALL LOST PRODUCT WAS RECOVERED BY LOADING FACILITY."
    ], 
    [
        "I-2005081232", 
        "MORRIS COOPERATIVE ASSOCIATION", 
        "MORRIS COOPERATIVE ASSOCIATION", 
        18224.0, 
        "2005-06-06", 
        "1751", 
        null, 
        null, 
        "AMMONIA ANHYDROUS", 
        73.524, 
        "GCF", 
        "A EMPLOYEE OF MORRIS COOP FILED A 1000 GALLON NH3 NURSE TANK TO 85% AT 15:30  & PARKED IT AT THE FENCED IN MORRIS COOP BULK PLANT.  AT 6:00 A 911 CALLER REPORTED AN ANHYDROUS EXPLOSION AT THE MORRIS COOP BULK PLANT.  THE NURSE TANK BLEW APPROXIMATELY A 31  X 29 1/2  HOLE IN THE LEFT REAR OF THE TANK.  A VAPOR CLOUD OF NH3 FORMED & MOVED WESTWARD WITH THE WIND 3-5 MPH.  THE DISIPATED ON VERY SHORT TIME NO CLEANUP WAS NEEDED"
    ], 
    [
        "E-2008120312", 
        "WESTERN COOP TRANSPORT ASSOCIATION", 
        "CHS INC.", 
        21000.0, 
        "2008-11-23", 
        "720", 
        null, 
        null, 
        "LIQUEFIED PETROLEUM GAS", 
        1187.375, 
        "LGA", 
        "At this time  the cause of the explosion is unknown.  There are on-going investigations to determine what failed and what triggered the explosion."
    ], 
    [
        "I-2013070248", 
        "FEDERAL EXPRESS CORPORATION", 
        "A.P. NONWEILER CO.  INC.", 
        0.0, 
        "2013-06-27", 
        "825", 
        "Closure (e.g.  Cap  Top  or Plug)", 
        "Bent", 
        "FLAMMABLE LIQUIDS  N.O.S.", 
        0.132085, 
        "LGA", 
        "This shipment began leaking during the sort. Standard spill cleanup procedures were followed."
    ]
]