[
    {
        "Explosion_Result_Ind": "No", 
        "Tot_Hazmat_Fatal": 0.0, 
        "Dest_State": "MONTANA", 
        "Inc_Zip": "56529", 
        "Rpt_Num": "X-2012010047", 
        "Tot_Hazmat_Inj": 0.0, 
        "Unit_of_Measure": "SLB", 
        "grouped_Commod_Long_Name": "AMMONIUM NITRATE  WITH NOT MORE THAN 0.2%  OF COMBUSTIBLE MATERIALS  INCLUDING ANY ORGANIC SUBSTANCE CALCULATED AS CARBON TO THE EXCLUSION OF ANY OTHER ADDED SUBSTANCE", 
        "Spill_Result_Ind": "Yes", 
        "Orig_Zip": null, 
        "Time_Inc": "1500", 
        "Gas_Dispersion_Result_Ind": "No", 
        "Fire_Result_Ind": "No", 
        "Inc_St": "MN", 
        "Mode_Transpo": "Rail", 
        "Date_Inc": "2011-12-15", 
        "Dest_City": "DECKER", 
        "Orig_State": null, 
        "Orig_City": null, 
        "Inc_City": "DILWORTH", 
        "Tot_Amt_of_Damages": 22000.0, 
        "Dest_Zip": "59025", 
        "What_Failed_Desc": "Bottom Outlet Valve", 
        "grouped_Ship_Name": "A N RESOURCES INC. BY KOCH FERTILIZER CANADA  ULC", 
        "grouped_C_R_Name": "BNSF RAILWAY COMPANY", 
        "How_Failed_Desc": "Leaked", 
        "No_Release_Result_Ind": "No", 
        "Tot_Evac": 0.0, 
        "Quant_Released": 48000.0, 
        "Desc_of_Events": "On 12/15/2011  BNSF Assistant Director Hazardous Material was informed by the shipper of CRDX 6046 (AAR C314  four compartment covered hopper) that they were notified by consignee that CRDX 6046 arrived at consignee's location missing commodity from hopper compartments with spillage on the ground at their facility. BNSF investigation of car movement records of CRDX 6046 revealed that in transit CRDX 6046 was stopped in Dilworth  MN on 11/17/2011 with a bottom outlet mechanical problem. Local mechanical responders reportedly wired closed a partially open bottom hopper outlet on 11/21/2011. A small amount of product spillage under CRDX 6046 was shoveled  followed by local disposal.   After the aforementioned 12/15/2011 notification  a response contractor was requested to have a vacuum truck go to Dilworth railyard and locations entering the railyard to vacuum up any product spillage found (later reporting that an estimated 3000 lbs. was vacuumed). This captured material was earmarked for appropriate disposal. Also  BNSF mechanical personnel were requested to inspect CRDX 6046 at its Decker  MT location and report on the operation of its bottom outlets. Inspection revealed that number 1 and 4 bottom outlet door gate systems would not close properly to securely lock shut due to capstans needing replacement and door gates out of adjustment.  CRDX 6046 was directed to a repair facility after the consignee unloaded and released it."
    }, 
    {
        "Explosion_Result_Ind": "No", 
        "Tot_Hazmat_Fatal": 0.0, 
        "Dest_State": null, 
        "Inc_Zip": "55008", 
        "Rpt_Num": "I-2007010319", 
        "Tot_Hazmat_Inj": 0.0, 
        "Unit_of_Measure": "LGA", 
        "grouped_Commod_Long_Name": "ALCOHOLS  N.O.S.", 
        "Spill_Result_Ind": "Yes", 
        "Orig_Zip": "57002", 
        "Time_Inc": "2030", 
        "Gas_Dispersion_Result_Ind": "Yes", 
        "Fire_Result_Ind": "No", 
        "Inc_St": "MN", 
        "Mode_Transpo": "Rail", 
        "Date_Inc": "2006-11-22", 
        "Dest_City": null, 
        "Orig_State": "SOUTH DAKOTA", 
        "Orig_City": "AURORA", 
        "Inc_City": "CAMBRIDGE", 
        "Tot_Amt_of_Damages": 436369.0, 
        "Dest_Zip": null, 
        "What_Failed_Desc": null, 
        "grouped_Ship_Name": "VERASUN ENERBY", 
        "grouped_C_R_Name": "DAKOTA  MINNESOTA & EASTERN RAILROAD CORPORATION", 
        "How_Failed_Desc": null, 
        "No_Release_Result_Ind": "No", 
        "Tot_Evac": 12.0, 
        "Quant_Released": 24877.0, 
        "Desc_of_Events": "DAKOTA  MINNESOTA & EASTERN RAILROD TRAIN #EAUCC-22 WAS EASTBOUND AT A RECORDED SPEED OF 24 MPH AT MILEPOST 157.75 WHEN IT ENCOUNTERED BROKEN RAIL.  SEVEN TANK CARS CONTAINING ETHANOL DERAILED WITH ALL BUT ONE CAR LEAVING THE RAIL.  THE FINAL CAR IN THE DERAILMENT CAME TO REST IN AN UPRIGHT POSITION ON A WOOD CONSTRUCTION BRIDGE.  THE TRAIN CREW BEGAN AN INSPECTION OF THE UNDESIRED EMERGENCY.  THEY SMELLED ETHYL ALCOHOL (ETHANOL) AND CONTACTED DISPATCH AND THE LOCAL EMERGENY RESPONSE TEAM.  AS INFORMATION FROM THE SCENE WAS RELAYED THROUGH DISPATCH  FORCES WERE DISPATCHED INCLUDING  LOCAL FIRE  AMBULANCE  LAW  DM&E'S HAZ-MAT MANAGER  MINNESTOA REGIONAL HAZ-MAT RESPONSE  CONTRACT HAZ-MAT RESPONDERS  ENVIRONMENTAL RESPONSE ENGINEERS  AND A RE-RAILING CONTRACTOR.  INITIAL DAMAGE ASSESSMENT INDICATED AT LEAST THREE CARS LEAKING PRODUCT TO THE GROUND.  THE AREA WAS A DRY CREEK BED.  TANK CAR ACFX 200406 WAS ON ITS SIDE WITH THE FILL VALVE BROKEN AND A SMALL PUNCUTRE IN THE MAN WAY COVER.  BOTH OF THESE LEAKS WERE GIVEN A TEMPORARY REPAIR WITH PLUGS AND PLUG AND PATCH MATERIAL.  TANK CAR RTMX 30684 WAS ON ITS SIDE LEAKING A SMALL AMOUNT OF PRODUCT FROM THE MAN WAY.  BOLTS WERE TIGHTENED.  TANK CAR GATX 35196 WAS UPRIGHT ON THE TRACK STRUCTURE  AT ABOUT A 20 DEGREE ANGLE WITH A 2 INCH GASH IN THE HEAD SHELL.  PLUGS AND PLUG AND DIKE WERE APPLIED.  DURING OUR SECOND DAMAGE ASSESSMENT  TANK CAR UTLX 46755 WAS NOTED UPRIGHT ON A BRIDGE LEAKING FROM AN UNKNOWN SOURCE.  IT WAS LATER DISCOVERED TO BE THE MAN WAY GASKET.  THE CAR WAS AT AN ANGLE ON THE BRIDGE THAT THE LEAK STOPPED ITSELF PRIOR TO SUNRISE.  EQUIPMENT AND MANPOWER WAS BROUGHT TO THE SITE THROUGOUT THE NIGHT AND EARLY MORNING.  THE CARS WERE MONITORED FOR FURTHER LEAKAGE  AIR MONITORING CONTINUED  AN EVACUATION OF 12 CITIZENS TOOK PLACE.  REMAINING PRODUCT WAS TRANS-LOADED TO RAILCARS.  ALL PRODUCT ON THE GROUND WAS VACUUMED AND SENT TO A DESTRUCTION FACILITY. FINAL TRANS-LOADING WAS COMPLETED ON NOVEMBER 25  2006 AT 2100 HRS.  TOTAL PRODUCT SPILLED WAS 24 877 GALLONS OF WHICH 11 807 GALLONS WERE RECOVERED AND DISPOSED OF IN ACCORDANCE WITH REGULATIONS."
    }, 
    {
        "Explosion_Result_Ind": "No", 
        "Tot_Hazmat_Fatal": 0.0, 
        "Dest_State": "NORTH DAKOTA", 
        "Inc_Zip": "56222", 
        "Rpt_Num": "X-2007110410", 
        "Tot_Hazmat_Inj": 0.0, 
        "Unit_of_Measure": "LGA", 
        "grouped_Commod_Long_Name": "HYDROCHLORIC ACID  SOLUTION", 
        "Spill_Result_Ind": "Yes", 
        "Orig_Zip": "67215", 
        "Time_Inc": "330", 
        "Gas_Dispersion_Result_Ind": "Yes", 
        "Fire_Result_Ind": "No", 
        "Inc_St": "MN", 
        "Mode_Transpo": "Rail", 
        "Date_Inc": "2007-10-29", 
        "Dest_City": "WAHPETON", 
        "Orig_State": "KANSAS", 
        "Orig_City": "WICHITA", 
        "Inc_City": "CLARA CITY", 
        "Tot_Amt_of_Damages": 230000.0, 
        "Dest_Zip": "58075", 
        "What_Failed_Desc": "Basic Material", 
        "grouped_Ship_Name": "OCCIDENTAL CHEMICAL CORP.", 
        "grouped_C_R_Name": "BNSF RAILWAY COMPANY", 
        "How_Failed_Desc": "Punctured", 
        "No_Release_Result_Ind": "No", 
        "Tot_Evac": 405.0, 
        "Quant_Released": 24500.0, 
        "Desc_of_Events": "A BNSF southbound train taking siding off the single main track derailed several railcars in the siding with some fouling the single main track. Shortly afterwards  a BNSF northbound train on the main track struck the rail equipment fouling the single main track which resulted in the derailment of the northbound train's two locomotive units and its head 22 railcars. Included in this derailment of the northbound train was UCLX 30002 (DOT 111A100W5 tank car) that came to rest in a slanted upright position atop other derailed rail equipment and sustained several breaches to its tank car shell. The B-end head sustained a large dent in the upper left head quadrant with a large peel tear in the head metal which allowed a large volume of product to escape. Also in the B-end head were two one inch puncture holes within the lower right head quadrant. The A-end side shell sustained a 3 inch by 3 inch puncture hole as well. It was estimated that the majority of the commodity within UCLX 30002 was lost. UCLX 30002 was cleaned and purged on site. BNSF contract responders applied lime to the ground spillage to neutralize the acid spill. Neutralized impacted soil was later excavated and staged for appropriate disposal.  Approximately 350 to 400 residents in the southwest portion of Clara City were evacuated. The evacuation ended at 1600 hrs. CDT  10/29/07. An overpass (MN State Highway 7) which runs over and is perpendicular to the main track and siding was closed until MN DOT officials inspected this structure for damages."
    }, 
    {
        "Explosion_Result_Ind": "No", 
        "Tot_Hazmat_Fatal": 0.0, 
        "Dest_State": null, 
        "Inc_Zip": "56748", 
        "Rpt_Num": "I-2012060157", 
        "Tot_Hazmat_Inj": 0.0, 
        "Unit_of_Measure": "LGA", 
        "grouped_Commod_Long_Name": "FLAMMABLE LIQUIDS  N.O.S.", 
        "Spill_Result_Ind": "Yes", 
        "Orig_Zip": null, 
        "Time_Inc": "430", 
        "Gas_Dispersion_Result_Ind": "No", 
        "Fire_Result_Ind": "Yes", 
        "Inc_St": "MN", 
        "Mode_Transpo": "Rail", 
        "Date_Inc": "2012-03-31", 
        "Dest_City": null, 
        "Orig_State": null, 
        "Orig_City": null, 
        "Inc_City": "PLUMMER", 
        "Tot_Amt_of_Damages": 2500.0, 
        "Dest_Zip": null, 
        "What_Failed_Desc": "Tank Shell", 
        "grouped_Ship_Name": "NOVA CHEMICALS CORPORATION", 
        "grouped_C_R_Name": "SOO LINE CORPORATION", 
        "How_Failed_Desc": "Gouged or Cut", 
        "No_Release_Result_Ind": "No", 
        "Tot_Evac": 30.0, 
        "Quant_Released": 23050.32786, 
        "Desc_of_Events": "A NORTH BOUND SEMI TRACTOR TRAILER IMPACTED AND DERAILED TANKCAR TILX 290058 THE WAS BEING PULLED INTO STUB TRACK ON THE BEMIDJI SUB TO CLEAR THE MAIN LINE. CAUSE AND COST UNDER INVESTIGATION"
    }, 
    {
        "Explosion_Result_Ind": "No", 
        "Tot_Hazmat_Fatal": 0.0, 
        "Dest_State": "ILLINOIS", 
        "Inc_Zip": "55033", 
        "Rpt_Num": "X-2008040313", 
        "Tot_Hazmat_Inj": 0.0, 
        "Unit_of_Measure": "LGA", 
        "grouped_Commod_Long_Name": "ENVIRONMENTALLY HAZARDOUS SUBSTANCES  LIQUID  N.O.S.", 
        "Spill_Result_Ind": "Yes", 
        "Orig_Zip": null, 
        "Time_Inc": "1545", 
        "Gas_Dispersion_Result_Ind": "No", 
        "Fire_Result_Ind": "No", 
        "Inc_St": "MN", 
        "Mode_Transpo": "Rail", 
        "Date_Inc": "2008-03-05", 
        "Dest_City": "CICERO", 
        "Orig_State": null, 
        "Orig_City": null, 
        "Inc_City": "HASTINGS", 
        "Tot_Amt_of_Damages": 90000.0, 
        "Dest_Zip": "60804", 
        "What_Failed_Desc": "Tank Shell", 
        "grouped_Ship_Name": "MEGLOBAL CANADA INC.", 
        "grouped_C_R_Name": "BNSF RAILWAY COMPANY", 
        "How_Failed_Desc": "Cracked", 
        "No_Release_Result_Ind": "No", 
        "Tot_Evac": 0.0, 
        "Quant_Released": 22507.4544, 
        "Desc_of_Events": "An eastbound BNSF train was stopped on BNSF Main Track 2 at the Minnesota-Wisconsin state border. This train stop was initiated by an air hose separation towards the head end of this train. During train inspection activities  entrained OWIX 15055 (a DOT 111A100W1 tank car stopped on the Minnesota side of the state border) was observed buckled with its side shell split open approximately near the mid-tank area. The product within escaped and ran down the track embankment onto the frozen shoreline of the Mississippi River that paralleled the main tracks at this location. The root cause of the tank's failure is under investigation via metallurgical testing and evaluation. BNSF environmental contractors initiated verification sampling of the impacted areas of ground and water.  Local officials closed the U.S. Highway 10 Bridge that connects Minnesota and Wisconsin near Prescott  WI until approximately 2000 hrs. CST  3/05/08."
    }, 
    {
        "Explosion_Result_Ind": "No", 
        "Tot_Hazmat_Fatal": 0.0, 
        "Dest_State": "MINNESOTA", 
        "Inc_Zip": "55107", 
        "Rpt_Num": "E-2012040375", 
        "Tot_Hazmat_Inj": 0.0, 
        "Unit_of_Measure": "LGA", 
        "grouped_Commod_Long_Name": "CAUSTIC SODA  (ETC.", 
        "Spill_Result_Ind": "Yes", 
        "Orig_Zip": "70765", 
        "Time_Inc": "920", 
        "Gas_Dispersion_Result_Ind": "No", 
        "Fire_Result_Ind": "No", 
        "Inc_St": "MN", 
        "Mode_Transpo": "Water", 
        "Date_Inc": "2012-04-18", 
        "Dest_City": "SAINT PAUL", 
        "Orig_State": "LOUISIANA", 
        "Orig_City": "PLAQUEMINE", 
        "Inc_City": "ST. PAUL", 
        "Tot_Amt_of_Damages": 32000.0, 
        "Dest_Zip": "55107", 
        "What_Failed_Desc": null, 
        "grouped_Ship_Name": "AXIALL  LLC", 
        "grouped_C_R_Name": "UPPER RIVER SERVICES  LLC", 
        "How_Failed_Desc": null, 
        "No_Release_Result_Ind": "No", 
        "Tot_Evac": 0.0, 
        "Quant_Released": 14000.0, 
        "Desc_of_Events": "Prior to unloading a Caustic Soda Barge the Terminal Operator failed to close a 2  water addition valve/hose connection that connected to the 6-inch unloading pipe.  This valve and pipe are inside of the tank containment area.  The Barge began unloading and some of the Caustic Soda entered this open 2  water addition valve/hose connection and spilled into the containment area.  Estimated flow time out of the 2  connection is one hour and five minutes.  When discovered the barge unloading was terminated and the 2  valve was closed.  The Terminal Supervisor contacted the Operations Manager.  The In-House Response Team responded gathered to begin the clean up process.  The Incident Commander/Operations Manager called the Minnesota Duty Officer and 911 to report the spill.  The spilled Caustic Soda was pumped into tanker trucks.  The cement containment area was cleaned and rinsed."
    }, 
    {
        "Explosion_Result_Ind": "No", 
        "Tot_Hazmat_Fatal": 0.0, 
        "Dest_State": "MINNESOTA", 
        "Inc_Zip": "55065", 
        "Rpt_Num": "E-2011010088", 
        "Tot_Hazmat_Inj": 55.0, 
        "Unit_of_Measure": "GCF", 
        "grouped_Commod_Long_Name": "AMMONIA ANHYDROUS", 
        "Spill_Result_Ind": "No", 
        "Orig_Zip": "55068", 
        "Time_Inc": "745", 
        "Gas_Dispersion_Result_Ind": "Yes", 
        "Fire_Result_Ind": "No", 
        "Inc_St": "MN", 
        "Mode_Transpo": "Highway", 
        "Date_Inc": "2010-12-08", 
        "Dest_City": "RANDOLPH", 
        "Orig_State": "MINNESOTA", 
        "Orig_City": "ROSEMOUNT", 
        "Inc_City": "RANDOLPH", 
        "Tot_Amt_of_Damages": 0.0, 
        "Dest_Zip": "55065", 
        "What_Failed_Desc": "Closure (e.g.  Cap  Top  or Plug)", 
        "grouped_Ship_Name": "CHS INC.", 
        "grouped_C_R_Name": "WESTERN COOP TRANSPORT ASSOCIATION", 
        "How_Failed_Desc": "Vented", 
        "No_Release_Result_Ind": "No", 
        "Tot_Evac": 500.0, 
        "Quant_Released": 11100.0, 
        "Desc_of_Events": "Driver was unloading anhydrous ammonia into an 18 000 gallon above ground storage tank.  The customer had ordered four loads.  The driver started to unload the product and saw vapor coming from the storage tank.  He immediately shut down the truck pump and notified the customer who then closed a valve on the storag tank where they had removed a pump."
    }, 
    {
        "Explosion_Result_Ind": "No", 
        "Tot_Hazmat_Fatal": 0.0, 
        "Dest_State": "FLORIDA", 
        "Inc_Zip": null, 
        "Rpt_Num": "I-2001011039", 
        "Tot_Hazmat_Inj": 0.0, 
        "Unit_of_Measure": "LGA", 
        "grouped_Commod_Long_Name": "SULFUR  MOLTEN", 
        "Spill_Result_Ind": "Yes", 
        "Orig_Zip": null, 
        "Time_Inc": "715", 
        "Gas_Dispersion_Result_Ind": "Yes", 
        "Fire_Result_Ind": "Yes", 
        "Inc_St": "MN", 
        "Mode_Transpo": "Rail", 
        "Date_Inc": "2000-12-18", 
        "Dest_City": "PLANT CITY", 
        "Orig_State": null, 
        "Orig_City": null, 
        "Inc_City": "PLYMOUTH", 
        "Tot_Amt_of_Damages": 1600000.0, 
        "Dest_Zip": "33565", 
        "What_Failed_Desc": "Basic Material;", 
        "grouped_Ship_Name": "SHELL CANADA LTD", 
        "grouped_C_R_Name": "CANADIAN PACIFIC LTD", 
        "How_Failed_Desc": "Punctured; Crushed", 
        "No_Release_Result_Ind": "No", 
        "Tot_Evac": 0.0, 
        "Quant_Released": 10000.0, 
        "Desc_of_Events": "TWENTY EIGHT CAR DERAILRMENT DUE TO POSSIBLE WHEEL METAL FATIGUE -- PENDING FURTHER INVESTIGATION.  SEVEN TANK CARS AND TWENTY EIGHT TANK CARS DERAILED CONTIANED MOLTEN SULPHUR THAT WERE PUNCTURED VIA PIECES OF RAIL AND/OR OTHER TANK CAR COUPLERS DURING THE INCIDENT. MOLTEN SULFUR THAT WAS RELEASED SOLIDIFIED IMMEDIATELY DUE TO INCLIMATE WEATHER (-15 F).  HOWEVER  TANK CAR PROX 006000 RELEASED VAPORS WHICH IGNITED ON ADJACENT SOIL SURFACES.  FIRE SUPPRESSION INCLUDED A LIGHT FOG TO COOL THE MOLTEN SULFUR AND TO EXTINGUISH ALL POTENTIAL REFLASH.  TWENTY SIX OF THE DERAILED TANK CARS WERE RELOCATED TO A STAGING AREA - AWAITNG DISPOSAL.  IMPACTED SOIL/RECOVERED SULPHUR WILL BE DISPOSED OF IN SAME MANNER AS TANK CARS - WITHIN ALL APPLICABLE REGULATIONS AT A REGIONAL LANDFILL. SITE RESTORATION AND DISPOSAL WILL COMMENCE WHEN WEATHER PERMITS AND ACCESS CAN BE CONSTRUCTED."
    }, 
    {
        "Explosion_Result_Ind": "No", 
        "Tot_Hazmat_Fatal": 1.0, 
        "Dest_State": "NORTH DAKOTA", 
        "Inc_Zip": null, 
        "Rpt_Num": "I-2001020075", 
        "Tot_Hazmat_Inj": 0.0, 
        "Unit_of_Measure": "LGA", 
        "grouped_Commod_Long_Name": "GASOLINE", 
        "Spill_Result_Ind": "Yes", 
        "Orig_Zip": null, 
        "Time_Inc": "1300", 
        "Gas_Dispersion_Result_Ind": "No", 
        "Fire_Result_Ind": "Yes", 
        "Inc_St": "MN", 
        "Mode_Transpo": "Highway", 
        "Date_Inc": "2001-01-29", 
        "Dest_City": "FARGO", 
        "Orig_State": "NORTH DAKOTA", 
        "Orig_City": "FARGO", 
        "Inc_City": "BARNESVILLE", 
        "Tot_Amt_of_Damages": 107600.0, 
        "Dest_Zip": "58103", 
        "What_Failed_Desc": "; ;", 
        "grouped_Ship_Name": "MAGELLAN PIPELINE COMPANY  L.P.", 
        "grouped_C_R_Name": "STORMY TRANSPORT INC", 
        "How_Failed_Desc": "Punctured; Burst or Ruptured; Crushed", 
        "No_Release_Result_Ind": "No", 
        "Tot_Evac": 0.0, 
        "Quant_Released": 8803.0, 
        "Desc_of_Events": "OUR VEHICLE WAS INVOLVED WITH ANOTHER SEMI-TRAILER. THE OTHER VEHICLE RAN A STOP SIGN  THEN T BONEING OUR TANKER. THE CRASH CAUSED OUR TANKER TO TIP OVER AND CAUSING PRODUCT TO SPILL OUT. DURING CRASH THE GASOLINE SPILLED OUT AND WAS IGNITED. ALL PRODUCT WAS BURNED UP AND THE SITE WAS TESTED WITH NO PRODUCT CONTAMINATING THE AREA. THE DRIVER OF THE  OTHER TRACTOR WAS KILLED ON IMPACT. OUR DRIVER WAS TREATED AND RELEASED. ALL VEHICLES WERE TOWED FROM SCENE."
    }, 
    {
        "Explosion_Result_Ind": "No", 
        "Tot_Hazmat_Fatal": 0.0, 
        "Dest_State": "MINNESOTA", 
        "Inc_Zip": null, 
        "Rpt_Num": "I-2002090430", 
        "Tot_Hazmat_Inj": 0.0, 
        "Unit_of_Measure": "LGA", 
        "grouped_Commod_Long_Name": "GASOLINE", 
        "Spill_Result_Ind": "Yes", 
        "Orig_Zip": "55733", 
        "Time_Inc": "1600", 
        "Gas_Dispersion_Result_Ind": "No", 
        "Fire_Result_Ind": "No", 
        "Inc_St": "MN", 
        "Mode_Transpo": "Highway", 
        "Date_Inc": "2002-08-08", 
        "Dest_City": "VIRGINIA", 
        "Orig_State": "MINNESOTA", 
        "Orig_City": "ESKO", 
        "Inc_City": "TWIG", 
        "Tot_Amt_of_Damages": 161500.0, 
        "Dest_Zip": "55792", 
        "What_Failed_Desc": ";", 
        "grouped_Ship_Name": "MURPHY OIL USA  INC.", 
        "grouped_C_R_Name": "STORMY TRANSPORT INC", 
        "How_Failed_Desc": "Punctured;", 
        "No_Release_Result_Ind": "No", 
        "Tot_Evac": 0.0, 
        "Quant_Released": 8603.0, 
        "Desc_of_Events": "OUR VEHICLE DROVE OFF THE ROAD TO THE RIGHT CAUSING IT TO ROLL OVER AND PUNCTURE THE TANK AND ALL THE PRODUCT LEAKED OUT.  NO FIRE OR OTHER PEOPLE WERE INVOLVED.  UNDETERMINED WHY DRIVER DROVE OFF THE ROAD.  HE WAS KILLED FROM IMPACT AND ROLLING OF TRACTOR TRAILER.  BORE SIGHTING WAS DONE TO PREVENT MORE DAMAGE TO AREA.  TRACTOR AND TRAILER WERE TOWED TO REPAIR FACILITIES."
    }
]